//============================================
//
//	プレイヤー2Dのサンプル [Player2D.cpp]
//	Author:sakamoto kai
//
//============================================
#include "Player2D.h"
#include "renderer.h"
#include "manager.h"

//マクロ定義
#define SAMPLE_WIGHT (60.0f)		//横幅
#define SAMPLE_HEIGHT (80.0f)		//縦幅

//====================================================================
//コンストラクタ
//====================================================================
CPlayer2D::CPlayer2D(int nPriority) : CObject2D(nPriority)
{
	SetWidth(SAMPLE_WIGHT);
	SetHeight(SAMPLE_HEIGHT);
	m_nSample = 0;
	m_bRight = true;
}

//====================================================================
//デストラクタ
//====================================================================
CPlayer2D::~CPlayer2D()
{

}

//====================================================================
//生成処理
//====================================================================
CPlayer2D* CPlayer2D::Create(int nPriority)
{
	CPlayer2D* pSample2D = NULL;

	if (pSample2D == NULL)
	{
		//オブジェクト2Dの生成
		pSample2D = new CPlayer2D(nPriority);
	}

	//オブジェクトの初期化処理
	if (FAILED(pSample2D->Init()))
	{//初期化処理が失敗した場合
		return NULL;
	}

	return pSample2D;
}

//====================================================================
//初期化処理
//====================================================================
HRESULT CPlayer2D::Init(void)
{
	CObject2D::Init();

	////テクスチャ設定
	//SetTexture("data\\TEXTURE\\Number01.png");

	//新しくcppを作成した時は新しいTYPEを列挙に追加して指定すること
	SetType(CObject::TYPE_SAMPLE);

	return S_OK;
}

//====================================================================
//終了処理
//====================================================================
void CPlayer2D::Uninit(void)
{
	CObject2D::Uninit();
}

//====================================================================
//更新処理
//====================================================================
void CPlayer2D::Update(void)
{
	//頂点情報の更新
	CObject2D::Update();

	D3DXVECTOR3 pos = GetPos();

	Move(&pos);

	SetPos(pos);
}

//====================================================================
//描画処理
//====================================================================
void CPlayer2D::Draw(void)
{
	CObject2D::Draw();
}

//====================================================================
//移動処理
//====================================================================
void CPlayer2D::Move(D3DXVECTOR3* pos)
{
	float fMove = 5.0f;

	if (m_bRight)
	{
		pos->x += fMove;
	}
	else
	{
		pos->x -= fMove;
	}
}